backend/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    courses = Course.all

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    course = Course.find(params[:id])