backend/app/controllers/forms_controller.rb

  def index
    forms = Form.all
---
SELECT "forms".* FROM "forms"

  def show
    form = Form.find(params[:id])
---
SELECT "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def set_form
      @form = Form.find(params[:id])
---
SELECT "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]