backend/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ochacha@gmail.com"], ["LIMIT", 1]]
---
  def login
    begin
      user = User.find_by(email: params[:email])