backend/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    @admission = @student.admissions.build(admission_date: params[:admission_date], admission_number: params[:admission_number], status: params[:status] || 'waiting', course_id: params[:course_id])

    if @student.save && @admission.save
      NewAdmissionMailer.with(student: @student).waiting_email(@student).deliver_now
---
INSERT INTO "students" ("first_name", "last_name", "gender", "email", "date_of_birth", "admission_year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "students".* FROM "students"

  def destroy
    @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]