backend/app/controllers/teachers_controller.rb

 def index
   teachers = Teacher.includes(:forms)
---
SELECT "teachers".* FROM "teachers"