backend/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "moses@gmail.com"], ["password_digest", "[FILTERED]"], ["username", "Moses"], ["created_at", "2023-03-29 08:53:46.990132"], ["updated_at", "2023-03-29 08:53:46.990132"]]
---
  def create
    begin
      user = User.new(user_params)
      user.password = params[:password]
      user.password_confirmation = params[:password_confirmation]
      user.save!