backend/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "password_digest", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "moses@gmail.com"], ["password_digest", "[FILTERED]"], ["username", "Moses"], ["created_at", "2023-03-29 08:53:46.990132"], ["updated_at", "2023-03-29 08:53:46.990132"]]